; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op- blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem blocks_words)
	(:domain blocks)
(:objects 

M O T H E R W A - block
)
(:init
(HANDEMPTY)
(CLEAR M)
(ON M O)
(ONTABLE O)
(CLEAR E)
(ONTABLE E)
(CLEAR T)
(ON T W)
(ONTABLE W)
(CLEAR H)
(ONTABLE H)
(CLEAR R)
(ON R A)
(ONTABLE A)
)
(:goal (and
(CLEAR T)
(ONTABLE R)
(ON T O)
(ON O W)
(ON W E)
(ON E R)
))
)

; plan
1. (unstack r a)
   deleted: (clear r) (handempty) (on r a)
   added: (holding r) (clear a)
   goals met: 1 of 6
2. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 2 of 6
3. (unstack t w)
   deleted: (clear t) (handempty) (on t w)
   added: (holding t) (clear w)
   goals met: 1 of 6
4. (stack t a)
   deleted: (holding t) (clear a)
   added: (clear t) (handempty) (on t a)
   goals met: 2 of 6
5. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 2 of 6
6. (stack e r)
   deleted: (holding e) (clear r)
   added: (clear e) (handempty) (on e r)
   goals met: 3 of 6
7. (pick-up w)
   deleted: (ontable w) (clear w) (handempty)
   added: (holding w)
   goals met: 3 of 6
8. (stack w e)
   deleted: (holding w) (clear e)
   added: (clear w) (handempty) (on w e)
   goals met: 4 of 6
9. (unstack m o)
   deleted: (clear m) (handempty) (on m o)
   added: (holding m) (clear o)
   goals met: 4 of 6
10. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 4 of 6
11. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 4 of 6
12. (stack o w)
   deleted: (holding o) (clear w)
   added: (clear o) (handempty) (on o w)
   goals met: 5 of 6
13. (unstack t a)
   deleted: (clear t) (handempty) (on t a)
   added: (holding t) (clear a)
   goals met: 4 of 6
14. (stack t o)
   deleted: (holding t) (clear o)
   added: (clear t) (handempty) (on t o)
   goals met: 6 of 6
